app/controllers/manage/users_controller.rb

    def index
      @users = User.includes(:roles).backend_search(keyword: params[:q]).order("users.created_at DESC")
        .paginate(page: params[:page], per_page: 100)
---
SELECT `user_roles`.* FROM `user_roles` WHERE `user_roles`.`user_id` = 1
SELECT `users`.* FROM `users` ORDER BY users.created_at DESC LIMIT 100 OFFSET 0