app/controllers/users/sessions_controller.rb

  def create
    account = params[:user][:account].strip
    @user = User.where("email = :key OR mobile = :key", key: account).last
---
SELECT `users`.* FROM `users` WHERE (email = 'cjw624923@126.com' OR mobile = 'cjw624923@126.com') ORDER BY `users`.`id` DESC LIMIT 1